Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Constructor (Boolean)
 Creates a new curved dimension set radial attributes instance which loads standard attributes. If it set to true attributes won't be lodaded.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetRadialAttributes(
	bool SkipLoadingAttributes
)
Public Sub New (
	SkipLoadingAttributes As Boolean
)
Parameters
SkipLoadingAttributes
Type: System.Boolean
[Missing <param name="SkipLoadingAttributes"/> documentation for "M:Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.#ctor(System.Boolean)"]
See Also
Reference
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Class
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Overload
Tekla.Structures.Drawing Namespace